In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\win10\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (8.4.0)

In [2]:
import pandas as pd

In [3]:
import mysql.connector # !pip install mysql-connector-python 
from mysql.connector import Error

try: 
    connection = mysql.connector.connect(host=' ', 
                                         database=  ,
                                         user=   ,
                                         password=   , connection_timeout=180)

    if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL database... MySQL Server version on ", db_Info)

        cursor = connection.cursor()
        connection.commit()

except Error as e:
    print("Error while connecting to MySQL", e)
finally:
    # closing database connection.
    if connection.is_connected():
        cursor.close()
        connection.close()
        print("MySQL connection is closed")

Connected to MySQL database... MySQL Server version on  8.0.34-26
MySQL connection is closed

## Esquema de informacion de la base de datos

In [4]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180000)

esquema = pd.read_sql("SELECT * FROM INFORMATION_SCHEMA.Tables", connection)
esquema

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\1686053512.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  esquema = pd.read_sql("SELECT * FROM INFORMATION_SCHEMA.Tables", connection)

,TABLE_CATALOG,TABLE_SCHEMA,TABLE_NAME,TABLE_TYPE,ENGINE,VERSION,ROW_FORMAT,TABLE_ROWS,AVG_ROW_LENGTH,DATA_LENGTH,...,INDEX_LENGTH,DATA_FREE,AUTO_INCREMENT,CREATE_TIME,UPDATE_TIME,CHECK_TIME,TABLE_COLLATION,CHECKSUM,CREATE_OPTIONS,TABLE_COMMENT
0,def,information_schema,ADMINISTRABLE_ROLE_AUTHORIZATIONS,SYSTEM VIEW,None,10,None,0,0,0,...,0,0,NaN,2024-05-08 07:09:36,None,None,None,None,,
1,def,information_schema,APPLICABLE_ROLES,SYSTEM VIEW,None,10,None,0,0,0,...,0,0,NaN,2024-05-08 07:09:36,None,None,None,None,,
2,def,information_schema,CHARACTER_SETS,SYSTEM VIEW,None,10,None,0,0,0,...,0,0,NaN,2024-05-08 06:54:31,None,None,None,None,,
3,def,information_schema,CHECK_CONSTRAINTS,SYSTEM VIEW,None,10,None,0,0,0,...,0,0,NaN,2024-05-08 06:54:31,None,None,None,None,,
4,def,information_schema,CLIENT_STATISTICS,SYSTEM VIEW,None,10,None,0,0,0,...,0,0,NaN,2024-05-08 06:54:31,None,None,None,None,,
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
174,def,dbyre4lbjoc4b4,PRODUCTO,BASE TABLE,InnoDB,10,Dynamic,18,910,16384,...,16384,0,NaN,2024-05-08 06:55:01,None,None,utf8mb4_general_ci,None,,
175,def,dbyre4lbjoc4b4,RANKING_PRODUCTOS,BASE TABLE,InnoDB,10,Dynamic,0,0,16384,...,16384,0,NaN,2024-05-08 06:55:01,None,None,utf8mb4_general_ci,None,,
176,def,dbyre4lbjoc4b4,REPARTIDOR,BASE TABLE,InnoDB,10,Dynamic,6,2730,16384,...,0,0,NaN,2024-05-08 06:55:01,None,None,utf8mb4_general_ci,None,,
177,def,dbyre4lbjoc4b4,consta,BASE TABLE,InnoDB,10,Dynamic,28,585,16384,...,16384,0,NaN,2024-05-08 06:55:01,None,None,utf8mb4_general_ci,None,,
178,def,dbyre4lbjoc4b4,esta_compuesto,BASE TABLE,InnoDB,10,Dynamic,23,712,16384,...,16384,0,NaN,2024-05-08 06:55:01,None,None,utf8mb4_general_ci,None,,

## Actividades propuestas por la cátedra.

### 1. Listar todos los productos.

In [5]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query1="""SELECT * FROM PRODUCTO;"""
cursor.execute(query1)
cursor.fetchall()

[('01', 'Hamburguesa', 2.6),
 ('02', 'Patatas', 2.0),
 ('03', 'tomate', 0.5),
 ('04', 'Queso', 1.0),
 ('05', 'Lechuga', 0.5),
 ('06', 'Pollo', 3.6),
 ('08', 'Bacon', 1.5),
 ('09', 'Coca cola', 3.0),
 ('10', 'Nestea', 3.0),
 ('11', 'Menú de Pollo', 5.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0),
 ('13', 'Menú de Pollo con queso', 6.0),
 ('14', 'Menú de Hamburguesa', 6.0),
 ('15', 'Helado', 1.0),
 ('16', 'Tarta', 2.0),
 ('17', 'Fruta', 1.0),
 ('18', 'Agua', 2.0),
 ('19', 'Fanta', 3.0)]

In [6]:
df1 = pd.read_sql(query1, connection)
df1

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\3656051463.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1 = pd.read_sql(query1, connection)

   Codigo                         Nombre  Precio
0      01                    Hamburguesa     2.6
1      02                        Patatas     2.0
2      03                         tomate     0.5
3      04                          Queso     1.0
4      05                        Lechuga     0.5
5      06                          Pollo     3.6
6      08                          Bacon     1.5
7      09                      Coca cola     3.0
8      10                         Nestea     3.0
9      11                  Menú de Pollo     5.0
10     12  Menú de Hamburguesa con queso     6.0
11     13        Menú de Pollo con queso     6.0
12     14            Menú de Hamburguesa     6.0
13     15                         Helado     1.0
14     16                          Tarta     2.0
15     17                          Fruta     1.0
16     18                           Agua     2.0
17     19                          Fanta     3.0

In [7]:
df1.to_csv('producto.csv', index=False)

### 2. Obtener los nombres de todos los empleados.

In [8]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query2="""SELECT nombre FROM EMPLEADO;"""
cursor.execute(query2)
cursor.fetchall()

[('María Luisa Galdón Ter',),
 ('Úrsula Delta Camacho',),
 ('Luis Ramírez Pardo',),
 ('Sergio Lérida Campos',),
 ('Piedad Colmenero Zapillo',),
 ('María Sánchez Cid',),
 ('Martín Guerrero López',),
 ('Carmen Hernández Pío',),
 ('Pedro Jiménez Ruiz',),
 ('Soledad Campillo Molina',),
 ('Raúl Rodrigo Roca',)]

In [110]:
df2 = pd.read_sql(query2, connection)
left_align(df2)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\2529798854.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql(query2, connection)

In [10]:
df2.to_csv('nombre_empleado.csv', index=False)

### 3. Contar el número de pedidos realizados.

In [11]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query3="""SELECT count(Numero) as pedidos_realizados FROM PEDIDO;"""
cursor.execute(query3)
cursor.fetchall()[0][0]

11

In [12]:
df3 = pd.read_sql(query3, connection)
df3

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\2037818295.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df3 = pd.read_sql(query3, connection)

   pedidos_realizados
0                  11

In [13]:
df3.to_csv('numero_pedidos.csv', index=False)

### 4. Listar los repartidores que trabajan en el turno de tarde.

In [14]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query4="""SELECT nombre FROM REPARTIDOR
where Turno ="tarde";"""
cursor.execute(query4)
cursor.fetchall()

[('Carlos Sánchez Ruíz',), ('Carmen Capel Pío',)]

In [15]:
df4 = pd.read_sql(query4, connection)
df4

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\136062298.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df4 = pd.read_sql(query4, connection)

                nombre
0  Carlos Sánchez Ruíz
1     Carmen Capel Pío

In [16]:
df4.to_csv('repartidores_noche.csv', index = False)

### 5. Encontrar el precio más alto de los productos.

In [111]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor = connection.cursor()
query5 = """Select max(precio) from PRODUCTO;"""
cursor.execute(query5)
cursor.fetchall()[0][0]

6.0

In [18]:
df5 = pd.read_sql(query5, connection)
df5

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\1613240993.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df5 = pd.read_sql(query5, connection)

   max(precio)
0          6.0

In [19]:
df5.to_csv('mayor_precio_productos.csv',index=False)

### 6.Mostrar todos los pedidos con un importe mayor a 100.

In [20]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query6 = """select * from PEDIDO where importe > 100;"""
cursor.execute(query6)
cursor.fetchall()

[]

In [21]:
df6 = pd.read_sql(query6, connection)
df6

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\4078655190.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df6 = pd.read_sql(query6, connection)

Empty DataFrame
Columns: [Numero, Fecha, Importe, DNI_ETM, DNI_EP, DNI_R, Hora_tm, Hora_pre, Hora_rep]
Index: []

In [22]:
df6.to_csv('importe_mayor_100.csv', index= False)

### 7.Obtener el salario promedio de los empleados.

In [113]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor= connection.cursor()
query7 = """select avg(salario) as salario_promedio from EMPLEADO;"""
cursor.execute(query7)
cursor.fetchall()[0][0]

1027.272727

In [114]:
df7 = pd.read_sql(query7, connection)
df7

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\3652498180.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df7 = pd.read_sql(query7, connection)

   salario_promedio
0       1027.272727

In [25]:
df7.to_csv('salario_promedio.csv', index=False)

### 8.Listar los productos que tienen un nombre único (sin duplicados).

In [117]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor = connection.cursor()
query8 = """select distinct nombre from PRODUCTO;"""
cursor.execute(query8)
cursor.fetchall()

[('Agua',),
 ('Bacon',),
 ('Coca cola',),
 ('Fanta',),
 ('Fruta',),
 ('Hamburguesa',),
 ('Helado',),
 ('Lechuga',),
 ('Menú de Hamburguesa',),
 ('Menú de Hamburguesa con queso',),
 ('Menú de Pollo',),
 ('Menú de Pollo con queso',),
 ('Nestea',),
 ('Patatas',),
 ('Pollo',),
 ('Queso',),
 ('Tarta',),
 ('tomate',)]

In [27]:
from pandas import DataFrame

def left_align(df: DataFrame):
    left_aligned_df = df.style.set_properties(**{'text-align': 'left'})
    left_aligned_df = left_aligned_df.set_table_styles(        [dict(selector='th', props=[('text-align', 'left')])]
    )
    return left_aligned_df

df8 = pd.read_sql(query8, connection)
left_align(df8)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\365943477.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df8 = pd.read_sql(query8, connection)

In [28]:
df8.to_csv('nombre_producto.csv', index=False)

### 9. Mostrar el número y la fecha de todos los pedidos realizados en el último mes.

In [29]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor = connection.cursor()
query9 = """SELECT Numero, Fecha FROM PEDIDO WHERE Fecha >= DATE_SUB(CURDATE(), INTERVAL 1 MONTH);"""
cursor.execute(query9)
cursor.fetchall()

[]

In [30]:
df9 = pd.read_sql(query9 , connection)
df9

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\683698647.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df9 = pd.read_sql(query9 , connection)

Empty DataFrame
Columns: [Numero, Fecha]
Index: []

In [31]:
df9.to_csv('pedidos_mes_anterior.csv', index=False)

### 10. Encontrar el empleado con el salario más bajo.

In [32]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor = connection.cursor()
query10 = """select 	nombre, salario from EMPLEADO
where salario = (select min(Salario) from EMPLEADO);"""
cursor.execute(query10)
cursor.fetchall()

[('Úrsula Delta Camacho', 900.0),
 ('Luis Ramírez Pardo', 900.0),
 ('Carmen Hernández Pío', 900.0)]

In [33]:
df10 = pd.read_sql(query10, connection)
df10

left_align(df10)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\3886046141.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df10 = pd.read_sql(query10, connection)

In [34]:
df10.to_csv('empleado_menor_salario.csv', index = False)

### 11.Listar los productos y sus componentes.

In [35]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor = connection.cursor()
query11 = """SELECT 
    p.Codigo AS Producto_Codigo,
    p.Nombre AS Producto_Nombre,
    p.Precio AS Producto_Precio,
    c.Codigo_P_compuesto AS Componente_Codigo,
    pc.Nombre AS Componente_Nombre,
    pc.Precio AS Componente_Precio
FROM 
    PRODUCTO p
LEFT JOIN 
    esta_compuesto c ON p.Codigo = c.Codigo_P
LEFT JOIN 
    PRODUCTO pc ON c.Codigo_P_compuesto = pc.Codigo
ORDER BY 
    p.Codigo, c.Codigo_P_compuesto;;"""
cursor.execute(query11)
cursor.fetchall()

[('01', 'Hamburguesa', 2.6, None, None, None),
 ('02', 'Patatas', 2.0, None, None, None),
 ('03', 'tomate', 0.5, None, None, None),
 ('04', 'Queso', 1.0, None, None, None),
 ('05', 'Lechuga', 0.5, None, None, None),
 ('06', 'Pollo', 3.6, None, None, None),
 ('08', 'Bacon', 1.5, None, None, None),
 ('09', 'Coca cola', 3.0, None, None, None),
 ('10', 'Nestea', 3.0, None, None, None),
 ('11', 'Menú de Pollo', 5.0, '02', 'Patatas', 2.0),
 ('11', 'Menú de Pollo', 5.0, '03', 'tomate', 0.5),
 ('11', 'Menú de Pollo', 5.0, '06', 'Pollo', 3.6),
 ('11', 'Menú de Pollo', 5.0, '17', 'Fruta', 1.0),
 ('11', 'Menú de Pollo', 5.0, '18', 'Agua', 2.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0, '01', 'Hamburguesa', 2.6),
 ('12', 'Menú de Hamburguesa con queso', 6.0, '02', 'Patatas', 2.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0, '04', 'Queso', 1.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0, '10', 'Nestea', 3.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0, '16', 'Tarta', 2.0),
 ('13', 'Menú de Pollo con queso', 6.0, '02', 'Patatas', 2.0),
 ('13', 'Menú de Pollo con queso', 6.0, '04', 'Queso', 1.0),
 ('13', 'Menú de Pollo con queso', 6.0, '06', 'Pollo', 3.6),
 ('13', 'Menú de Pollo con queso', 6.0, '08', 'Bacon', 1.5),
 ('13', 'Menú de Pollo con queso', 6.0, '09', 'Coca cola', 3.0),
 ('13', 'Menú de Pollo con queso', 6.0, '15', 'Helado', 1.0),
 ('14', 'Menú de Hamburguesa', 6.0, '01', 'Hamburguesa', 2.6),
 ('14', 'Menú de Hamburguesa', 6.0, '02', 'Patatas', 2.0),
 ('14', 'Menú de Hamburguesa', 6.0, '03', 'tomate', 0.5),
 ('14', 'Menú de Hamburguesa', 6.0, '05', 'Lechuga', 0.5),
 ('14', 'Menú de Hamburguesa', 6.0, '08', 'Bacon', 1.5),
 ('14', 'Menú de Hamburguesa', 6.0, '09', 'Coca cola', 3.0),
 ('14', 'Menú de Hamburguesa', 6.0, '15', 'Helado', 1.0),
 ('15', 'Helado', 1.0, None, None, None),
 ('16', 'Tarta', 2.0, None, None, None),
 ('17', 'Fruta', 1.0, None, None, None),
 ('18', 'Agua', 2.0, None, None, None),
 ('19', 'Fanta', 3.0, None, None, None)]

In [36]:
df11 = pd.read_sql(query11, connection)
left_align(df11)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\264066487.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df11 = pd.read_sql(query11, connection)

In [37]:
df11.to_csv('prductos_componentes.csv', index=False)

### 12. Obtener el importe total de todos los pedidos.

In [118]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor = connection.cursor()
query12 = """select sum(importe) from PEDIDO;"""
cursor.execute(query12)
cursor.fetchall()[0][0]

234.0

In [39]:
df12 = pd.read_sql(query12, connection)
df12

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\1580659282.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df12 = pd.read_sql(query12, connection)

   sum(importe)
0         234.0

In [40]:
df12.to_csv('importe_total_pedidos.csv', index=False)

### 13. Mostrar los empleados que no son repartidores.

In [41]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query13="""select * from EMPLEADO;"""
cursor.execute(query13)

cursor.fetchall()

[('03232323P', 'María Luisa Galdón Ter', '43534534567', 'noche', 1200.0),
 ('04444444T', 'Úrsula Delta Camacho', '11177788899', 'mañana', 900.0),
 ('11111111Q', 'Luis Ramírez Pardo', '23445556666', 'mañana', 900.0),
 ('14111155T', 'Sergio Lérida Campos', '55577700089', 'tarde', 1000.0),
 ('14567555L', 'Piedad Colmenero Zapillo', '23456734534', 'noche', 1200.0),
 ('22222222S', 'María Sánchez Cid', '11112223334', 'tarde', 1000.0),
 ('33333333M', 'Martín Guerrero López', '33344455566', 'tarde', 1000.0),
 ('55555555J', 'Carmen Hernández Pío', '99966633311', 'mañana', 900.0),
 ('77777777M', 'Pedro Jiménez Ruiz', '23456785432', 'tarde', 1000.0),
 ('88888888O', 'Soledad Campillo Molina', '00088877754', 'noche', 1200.0),
 ('99999999X', 'Raúl Rodrigo Roca', '55566677789', 'tarde', 1000.0)]

In [42]:
df13 = pd.read_sql(query13, connection)
left_align(df13)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\3883311498.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df13 = pd.read_sql(query13, connection)

In [43]:
df13.to_csv('empeados_no_repartidores.csv', index=False)

### 14.Listar los pedidos junto con el nombre del empleado que tomó el pedido.

In [44]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query14="""select PEDIDO.*, EMPLEADO.nombre from PEDIDO
left join EMPLEADO ON EMPLEADO.DNI=PEDIDO.DNI_ETM;
"""
cursor.execute(query14)
cursor.fetchall()

[('0001',
  datetime.date(2020, 10, 15),
  10.0,
  '11111111Q',
  '04444444T',
  '55675675J',
  datetime.timedelta(seconds=43200),
  datetime.timedelta(seconds=44100),
  datetime.timedelta(seconds=45900),
  'Luis Ramírez Pardo'),
 ('0002',
  datetime.date(2020, 11, 11),
  15.0,
  '22222222S',
  '77777777M',
  '99009900J',
  datetime.timedelta(seconds=48600),
  datetime.timedelta(seconds=49500),
  datetime.timedelta(seconds=50700),
  'María Sánchez Cid'),
 ('0003',
  datetime.date(2020, 10, 15),
  13.0,
  '77777777M',
  '22222222S',
  '99009900J',
  datetime.timedelta(seconds=54000),
  datetime.timedelta(seconds=54900),
  datetime.timedelta(seconds=56700),
  'Pedro Jiménez Ruiz'),
 ('0004',
  datetime.date(2020, 11, 10),
  13.0,
  '99999999X',
  '77777777M',
  '04477744T',
  datetime.timedelta(seconds=50520),
  datetime.timedelta(seconds=52200),
  datetime.timedelta(seconds=53100),
  'Raúl Rodrigo Roca'),
 ('0005',
  datetime.date(2020, 9, 5),
  14.0,
  '14567555L',
  '03232323P',
  '14188151T',
  datetime.timedelta(seconds=68520),
  datetime.timedelta(seconds=70200),
  datetime.timedelta(seconds=71100),
  'Piedad Colmenero Zapillo'),
 ('0006',
  datetime.date(2020, 11, 15),
  23.0,
  '14567555L',
  '88888888O',
  '04477744T',
  datetime.timedelta(seconds=75720),
  datetime.timedelta(seconds=77700),
  datetime.timedelta(seconds=78300),
  'Piedad Colmenero Zapillo'),
 ('0007',
  datetime.date(2020, 9, 25),
  17.0,
  '03232323P',
  '88888888O',
  '14188151T',
  datetime.timedelta(seconds=83100),
  datetime.timedelta(seconds=83520),
  datetime.timedelta(seconds=84900),
  'María Luisa Galdón Ter'),
 ('0008',
  datetime.date(2020, 9, 15),
  14.0,
  '99999999X',
  '33333333M',
  '11245621Q',
  datetime.timedelta(seconds=64920),
  datetime.timedelta(seconds=66600),
  datetime.timedelta(seconds=67500),
  'Raúl Rodrigo Roca'),
 ('0009',
  datetime.date(2020, 11, 23),
  25.0,
  '04444444T',
  '55555555J',
  '99009900J',
  datetime.timedelta(seconds=39720),
  datetime.timedelta(seconds=41400),
  datetime.timedelta(seconds=42900),
  'Úrsula Delta Camacho'),
 ('0010',
  datetime.date(2020, 11, 5),
  45.0,
  '88888888O',
  '14567555L',
  None,
  datetime.timedelta(seconds=79500),
  datetime.timedelta(seconds=79920),
  None,
  'Soledad Campillo Molina'),
 ('0011',
  datetime.date(2020, 11, 5),
  45.0,
  '88888888O',
  '14567555L',
  None,
  datetime.timedelta(seconds=79500),
  None,
  None,
  'Soledad Campillo Molina')]

In [45]:
df14 = pd.read_sql(query14, connection)
left_align(df14)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\2416693713.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df14 = pd.read_sql(query14, connection)

In [46]:
df14.to_csv('pedidos_por_empleado_tomado.csv', index=False)

### 15.Encontrar la cantidad total de productos en cada pedido.

In [47]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query15="""select PEDIDO.*, count(PRODUCTO.Codigo) from PEDIDO
left join consta on PEDIDO.Numero = consta.Numero_P 
left join PRODUCTO on consta.Codigo_Pr=PRODUCTO.Codigo
group by PEDIDO.Numero;"""
cursor.execute(query15)
cursor.fetchall()

[('0001',
  datetime.date(2020, 10, 15),
  10.0,
  '11111111Q',
  '04444444T',
  '55675675J',
  datetime.timedelta(seconds=43200),
  datetime.timedelta(seconds=44100),
  datetime.timedelta(seconds=45900),
  2),
 ('0002',
  datetime.date(2020, 11, 11),
  15.0,
  '22222222S',
  '77777777M',
  '99009900J',
  datetime.timedelta(seconds=48600),
  datetime.timedelta(seconds=49500),
  datetime.timedelta(seconds=50700),
  3),
 ('0003',
  datetime.date(2020, 10, 15),
  13.0,
  '77777777M',
  '22222222S',
  '99009900J',
  datetime.timedelta(seconds=54000),
  datetime.timedelta(seconds=54900),
  datetime.timedelta(seconds=56700),
  2),
 ('0004',
  datetime.date(2020, 11, 10),
  13.0,
  '99999999X',
  '77777777M',
  '04477744T',
  datetime.timedelta(seconds=50520),
  datetime.timedelta(seconds=52200),
  datetime.timedelta(seconds=53100),
  2),
 ('0005',
  datetime.date(2020, 9, 5),
  14.0,
  '14567555L',
  '03232323P',
  '14188151T',
  datetime.timedelta(seconds=68520),
  datetime.timedelta(seconds=70200),
  datetime.timedelta(seconds=71100),
  3),
 ('0006',
  datetime.date(2020, 11, 15),
  23.0,
  '14567555L',
  '88888888O',
  '04477744T',
  datetime.timedelta(seconds=75720),
  datetime.timedelta(seconds=77700),
  datetime.timedelta(seconds=78300),
  4),
 ('0007',
  datetime.date(2020, 9, 25),
  17.0,
  '03232323P',
  '88888888O',
  '14188151T',
  datetime.timedelta(seconds=83100),
  datetime.timedelta(seconds=83520),
  datetime.timedelta(seconds=84900),
  3),
 ('0008',
  datetime.date(2020, 9, 15),
  14.0,
  '99999999X',
  '33333333M',
  '11245621Q',
  datetime.timedelta(seconds=64920),
  datetime.timedelta(seconds=66600),
  datetime.timedelta(seconds=67500),
  2),
 ('0009',
  datetime.date(2020, 11, 23),
  25.0,
  '04444444T',
  '55555555J',
  '99009900J',
  datetime.timedelta(seconds=39720),
  datetime.timedelta(seconds=41400),
  datetime.timedelta(seconds=42900),
  2),
 ('0010',
  datetime.date(2020, 11, 5),
  45.0,
  '88888888O',
  '14567555L',
  None,
  datetime.timedelta(seconds=79500),
  datetime.timedelta(seconds=79920),
  None,
  4),
 ('0011',
  datetime.date(2020, 11, 5),
  45.0,
  '88888888O',
  '14567555L',
  None,
  datetime.timedelta(seconds=79500),
  None,
  None,
  1)]

In [48]:

df15 = pd.read_sql(query15, connection)
df15

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\2532978199.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df15 = pd.read_sql(query15, connection)

,Numero,Fecha,Importe,DNI_ETM,DNI_EP,DNI_R,Hora_tm,Hora_pre,Hora_rep,count(PRODUCTO.Codigo)
0,0001,2020-10-15,10.0,11111111Q,04444444T,55675675J,0 days 12:00:00,0 days 12:15:00,0 days 12:45:00,2
1,0002,2020-11-11,15.0,22222222S,77777777M,99009900J,0 days 13:30:00,0 days 13:45:00,0 days 14:05:00,3
2,0003,2020-10-15,13.0,77777777M,22222222S,99009900J,0 days 15:00:00,0 days 15:15:00,0 days 15:45:00,2
3,0004,2020-11-10,13.0,99999999X,77777777M,04477744T,0 days 14:02:00,0 days 14:30:00,0 days 14:45:00,2
4,0005,2020-09-05,14.0,14567555L,03232323P,14188151T,0 days 19:02:00,0 days 19:30:00,0 days 19:45:00,3
5,0006,2020-11-15,23.0,14567555L,88888888O,04477744T,0 days 21:02:00,0 days 21:35:00,0 days 21:45:00,4
6,0007,2020-09-25,17.0,03232323P,88888888O,14188151T,0 days 23:05:00,0 days 23:12:00,0 days 23:35:00,3
7,0008,2020-09-15,14.0,99999999X,33333333M,11245621Q,0 days 18:02:00,0 days 18:30:00,0 days 18:45:00,2
8,0009,2020-11-23,25.0,04444444T,55555555J,99009900J,0 days 11:02:00,0 days 11:30:00,0 days 11:55:00,2
9,0010,2020-11-05,45.0,88888888O,14567555L,None,0 days 22:05:00,0 days 22:12:00,NaT,4
10,0011,2020-11-05,45.0,88888888O,14567555L,None,0 days 22:05:00,NaT,NaT,1

In [49]:
df15.to_csv('productos_por_pedido.csv', index=False)

### 16.Obtener el nombre del repartidor y el importe de los pedidos que ha entregado.

In [50]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query16="""select REPARTIDOR.nombre, sum(PEDIDO.importe) AS total_importe from REPARTIDOR
	left join PEDIDO ON PEDIDO.DNI_R=REPARTIDOR.DNI
    group by REPARTIDOR.Nombre;"""
cursor.execute(query16)

cursor.fetchall()

[('Laura Jiménez Jiménez', 36.0),
 ('Juan Pardo Rubio', 14.0),
 ('Carlos Sánchez Ruíz', 31.0),
 ('Carmen Capel Pío', None),
 ('Juan Sánchez López', 10.0),
 ('Alejandro Pardo López', 53.0)]

In [119]:

df16= pd.read_sql(query16, connection)
left_align(df16)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\476473060.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df16= pd.read_sql(query16, connection)

In [52]:

df16.to_csv('repartidor_importe.csv', index=False)

### 17. Listar todos los pedidos junto con la hora en que fueron tomados y preparados.

In [53]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query17="""select PEDIDO.Numero, PEDIDO.Hora_tm, PEDIDO.Hora_pre from PEDIDO;"""
cursor.execute(query17)
cursor.fetchall()

[('0001',
  datetime.timedelta(seconds=43200),
  datetime.timedelta(seconds=44100)),
 ('0002',
  datetime.timedelta(seconds=48600),
  datetime.timedelta(seconds=49500)),
 ('0003',
  datetime.timedelta(seconds=54000),
  datetime.timedelta(seconds=54900)),
 ('0004',
  datetime.timedelta(seconds=50520),
  datetime.timedelta(seconds=52200)),
 ('0005',
  datetime.timedelta(seconds=68520),
  datetime.timedelta(seconds=70200)),
 ('0006',
  datetime.timedelta(seconds=75720),
  datetime.timedelta(seconds=77700)),
 ('0007',
  datetime.timedelta(seconds=83100),
  datetime.timedelta(seconds=83520)),
 ('0008',
  datetime.timedelta(seconds=64920),
  datetime.timedelta(seconds=66600)),
 ('0009',
  datetime.timedelta(seconds=39720),
  datetime.timedelta(seconds=41400)),
 ('0010',
  datetime.timedelta(seconds=79500),
  datetime.timedelta(seconds=79920)),
 ('0011', datetime.timedelta(seconds=79500), None)]

In [54]:
df17 = pd.read_sql(query17, connection)
df17

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\2083312550.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df17 = pd.read_sql(query17, connection)

   Numero         Hora_tm        Hora_pre
0    0001 0 days 12:00:00 0 days 12:15:00
1    0002 0 days 13:30:00 0 days 13:45:00
2    0003 0 days 15:00:00 0 days 15:15:00
3    0004 0 days 14:02:00 0 days 14:30:00
4    0005 0 days 19:02:00 0 days 19:30:00
5    0006 0 days 21:02:00 0 days 21:35:00
6    0007 0 days 23:05:00 0 days 23:12:00
7    0008 0 days 18:02:00 0 days 18:30:00
8    0009 0 days 11:02:00 0 days 11:30:00
9    0010 0 days 22:05:00 0 days 22:12:00
10   0011 0 days 22:05:00             NaT

In [55]:
df17.to_csv('pedido_por_hora.csv', index=False)

### 18.Mostrar el total de incentivos pagados a los repartidores.

In [120]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query18="""select sum(REPARTIDOR.Incentivo) as total_incentivos from REPARTIDOR;;"""
cursor.execute(query18)
cursor.fetchall()[0][0]

2000.0

In [121]:
df18 = pd.read_sql(query18, connection)
df18

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\2319126293.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df18 = pd.read_sql(query18, connection)

   total_incentivos
0            2000.0

In [58]:
df18.to_csv('incentivos_total.csv', index=False)

### 19.Encontrar los empleados que han tomado más de 5 pedidos.

In [59]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query19="""select EMPLEADO.*, count(PEDIDO.Numero) as total_pedidos from EMPLEADO
left join PEDIDO on PEDIDO.DNI_ETM = EMPLEADO.dni
group by EMPLEADO.dni
having count(PEDIDO.Numero) > 5;"""
cursor.execute(query19)
cursor.fetchall()

[]

In [60]:
df19 = pd.read_sql(query19, connection)
df19

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\2734780120.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df19 = pd.read_sql(query19, connection)

Empty DataFrame
Columns: [DNI, Nombre, Nss, Turno, Salario, total_pedidos]
Index: []

In [61]:
df19.to_csv('mas_5_pedidos.csv', index=False)

### 20. Listar todos los pedidos junto con el nombre del empleado que los preparó.

In [62]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query20="""select PEDIDO.numero, EMPLEADO.nombre from PEDIDO
LEFT JOIN EMPLEADO ON PEDIDO.dni_EP = EMPLEADO.dni;"""
cursor.execute(query20)
cursor.fetchall()

[('0005', 'María Luisa Galdón Ter'),
 ('0001', 'Úrsula Delta Camacho'),
 ('0010', 'Piedad Colmenero Zapillo'),
 ('0011', 'Piedad Colmenero Zapillo'),
 ('0003', 'María Sánchez Cid'),
 ('0008', 'Martín Guerrero López'),
 ('0009', 'Carmen Hernández Pío'),
 ('0002', 'Pedro Jiménez Ruiz'),
 ('0004', 'Pedro Jiménez Ruiz'),
 ('0006', 'Soledad Campillo Molina'),
 ('0007', 'Soledad Campillo Molina')]

In [63]:
df20 = pd.read_sql(query20, connection)
left_align(df20)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\3065400573.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df20 = pd.read_sql(query20, connection)

In [64]:
df20.to_csv('empleado_preparado.csv', index=False)

### 21.Mostrar los productos cuyo precio es mayor que el precio promedio de todos los productos.

In [65]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query21="""select nombre from PRODUCTO
where precio > (select avg(precio) from PRODUCTO);"""
cursor.execute(query21)
cursor.fetchall()

[('Pollo',),
 ('Coca cola',),
 ('Nestea',),
 ('Menú de Pollo',),
 ('Menú de Hamburguesa con queso',),
 ('Menú de Pollo con queso',),
 ('Menú de Hamburguesa',),
 ('Fanta',)]

In [66]:
df21 = pd.read_sql(query21, connection)
left_align(df21)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\3105170350.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df21 = pd.read_sql(query21, connection)

In [67]:
df21.to_csv('precio_mayor_promedio.csv', index=False)

### 22. Listar los empleados y repartidores con el mismo turno.

In [68]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query22="""select * from
(select EMPLEADO.DNI, 
		EMPLEADO.Nombre,
		EMPLEADO.Turno,
        "EMPLEADO" as clase
from EMPLEADO
union 
select  REPARTIDOR.dni,
        REPARTIDOR.Nombre,
        REPARTIDOR.Turno,
        "REPARTIDOR" as clase
from REPARTIDOR) as total_empleados
where turno = "noche";"""
cursor.execute(query22)
cursor.fetchall()

[('03232323P', 'María Luisa Galdón Ter', 'noche', 'EMPLEADO'),
 ('14567555L', 'Piedad Colmenero Zapillo', 'noche', 'EMPLEADO'),
 ('88888888O', 'Soledad Campillo Molina', 'noche', 'EMPLEADO'),
 ('04477744T', 'Laura Jiménez Jiménez', 'noche', 'REPARTIDOR'),
 ('11245621Q', 'Juan Pardo Rubio', 'noche', 'REPARTIDOR')]

In [69]:
df22 = pd.read_sql(query22, connection)
left_align(df22)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\16324022.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df22 = pd.read_sql(query22, connection)

In [70]:
df22.to_csv('empleados_repartidores_turnos', index=False)

### 23.Obtener los pedidos junto con el nombre del empleado que los tomó y el nombre del repartidor que los entregó.

In [71]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query23="""select PEDIDO.numero, REPARTIDOR.Nombre as Nombre_repartidor , EMPLEADO.Nombre as Nombre_empleado from PEDIDO
	left join EMPLEADO ON EMPLEADO.DNI=PEDIDO.DNI_ETM
    left join REPARTIDOR on REPARTIDOR.dni=PEDIDO.DNI_R;"""
cursor.execute(query23)
cursor.fetchall()

[('0001', 'Juan Sánchez López', 'Luis Ramírez Pardo'),
 ('0002', 'Alejandro Pardo López', 'María Sánchez Cid'),
 ('0003', 'Alejandro Pardo López', 'Pedro Jiménez Ruiz'),
 ('0004', 'Laura Jiménez Jiménez', 'Raúl Rodrigo Roca'),
 ('0005', 'Carlos Sánchez Ruíz', 'Piedad Colmenero Zapillo'),
 ('0006', 'Laura Jiménez Jiménez', 'Piedad Colmenero Zapillo'),
 ('0007', 'Carlos Sánchez Ruíz', 'María Luisa Galdón Ter'),
 ('0008', 'Juan Pardo Rubio', 'Raúl Rodrigo Roca'),
 ('0009', 'Alejandro Pardo López', 'Úrsula Delta Camacho'),
 ('0010', None, 'Soledad Campillo Molina'),
 ('0011', None, 'Soledad Campillo Molina')]

In [72]:
df23 = pd.read_sql(query23, connection)
left_align(df23)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\1424131854.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df23 = pd.read_sql(query23, connection)

In [73]:
df23.to_csv('pedidos_empleadotomo_repartidor.csv', index=False)

### 24.Mostrar los nombres de los productos en mayúsculas.

In [122]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query24="""select upper(nombre) as PRODUCTOS from PRODUCTO;"""
cursor.execute(query24)
cursor.fetchall()

[('AGUA',),
 ('BACON',),
 ('COCA COLA',),
 ('FANTA',),
 ('FRUTA',),
 ('HAMBURGUESA',),
 ('HELADO',),
 ('LECHUGA',),
 ('MENÚ DE HAMBURGUESA',),
 ('MENÚ DE HAMBURGUESA CON QUESO',),
 ('MENÚ DE POLLO',),
 ('MENÚ DE POLLO CON QUESO',),
 ('NESTEA',),
 ('PATATAS',),
 ('POLLO',),
 ('QUESO',),
 ('TARTA',),
 ('TOMATE',)]

In [123]:
df24 = pd.read_sql(query24, connection)
left_align(df24)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\1852967716.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df24 = pd.read_sql(query24, connection)

In [76]:
df24.to_csv('producto_mayuscula.csv', index=False)

### 25.Obtener el número de pedidos y el total del importe para cada repartidor.

In [77]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query25="""select 	REPARTIDOR.*,
		sum(PEDIDO.importe) as importe_total ,
        count(PEDIDO.Numero) as pedidos
from REPARTIDOR
left join PEDIDO ON PEDIDO.DNI_R=REPARTIDOR.DNI
group by REPARTIDOR.dni;"""
cursor.execute(query25)
cursor.fetchall()

[('04477744T', 'Laura Jiménez Jiménez', 'noche', 400.0, 36.0, 2),
 ('11245621Q', 'Juan Pardo Rubio', 'noche', 400.0, 14.0, 1),
 ('14188151T', 'Carlos Sánchez Ruíz', 'tarde', 300.0, 31.0, 2),
 ('51235555J', 'Carmen Capel Pío', 'tarde', 300.0, None, 0),
 ('55675675J', 'Juan Sánchez López', 'mañana', 200.0, 10.0, 1),
 ('99009900J', 'Alejandro Pardo López', 'mañana', 400.0, 53.0, 3)]

In [78]:
df25 = pd.read_sql(query25, connection)
left_align(df25)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\1461834953.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df25 = pd.read_sql(query25, connection)

In [79]:
df25.to_csv('pedidos_importe_repartidor.csv', index=False)

### 26. Mostrar los pedidos realizados en el año 2023.

In [80]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query26="""select * from PEDIDO
where year(PEDIDO.fecha)=2023;"""
cursor.execute(query26)
cursor.fetchall()

[]

In [81]:
df26 = pd.read_sql(query26, connection)
df26

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\3900559074.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df26 = pd.read_sql(query26, connection)

Empty DataFrame
Columns: [Numero, Fecha, Importe, DNI_ETM, DNI_EP, DNI_R, Hora_tm, Hora_pre, Hora_rep]
Index: []

In [82]:
df26.to_csv('pedidos2023.csv', index=False)

### 27.Listar los repartidores que han entregado pedidos en la última semana.

In [83]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query27="""SELECT nombre FROM REPARTIDOR 
LEFT JOIN PEDIDO ON REPARTIDOR.dni = PEDIDO.dni_r
WHERE Fecha >= DATE_SUB(CURDATE(), INTERVAL 1 WEEK);"""
cursor.execute(query27)
cursor.fetchall()

[]

In [84]:
df27 = pd.read_sql(query27, connection)
df27

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\2349410479.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df27 = pd.read_sql(query27, connection)

Empty DataFrame
Columns: [nombre]
Index: []

In [85]:
df27.to_csv('repartidores_ultima_semana.csv', index=False)

### 28.Obtener la diferencia en días entre la fecha del pedido y la fecha actual para todos los pedidos.

In [86]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query28="""select numero, datediff(current_date(),PEDIDO.fecha) as diferencia_dias from PEDIDO;"""
cursor.execute(query28)
cursor.fetchall()

[('0001', 1323),
 ('0002', 1296),
 ('0003', 1323),
 ('0004', 1297),
 ('0005', 1363),
 ('0006', 1292),
 ('0007', 1343),
 ('0008', 1353),
 ('0009', 1284),
 ('0010', 1302),
 ('0011', 1302)]

In [87]:
df28 = pd.read_sql(query28, connection)
df28

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\2210374171.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df28 = pd.read_sql(query28, connection)

   numero  diferencia_dias
0    0001             1323
1    0002             1296
2    0003             1323
3    0004             1297
4    0005             1363
5    0006             1292
6    0007             1343
7    0008             1353
8    0009             1284
9    0010             1302
10   0011             1302

In [88]:
df28.to_csv('diferencia_dias_actual.csv', index=False)

### 29. Listar los empleados que trabajan en el turno de mañana y tienen un salario mayor a 2000.

In [89]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query29="""select * from EMPLEADO
where turno = "mañana" and Salario > 2000;;"""
cursor.execute(query29)
cursor.fetchall()

[]

In [90]:
df29 = pd.read_sql(query29, connection)
df29

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\585492806.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df29 = pd.read_sql(query29, connection)

Empty DataFrame
Columns: [DNI, Nombre, Nss, Turno, Salario]
Index: []

In [91]:
df29.to_csv('turnomañana_salario2000.csv', index=False)

### 30.Mostrar los productos y su precio con un incremento del 10%.

In [92]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query30="""select nombre, precio * 1.10 from PRODUCTO;"""
cursor.execute(query30)
cursor.fetchall()

[('Hamburguesa', 2.86),
 ('Patatas', 2.2),
 ('tomate', 0.55),
 ('Queso', 1.1),
 ('Lechuga', 0.55),
 ('Pollo', 3.96),
 ('Bacon', 1.65),
 ('Coca cola', 3.3),
 ('Nestea', 3.3),
 ('Menú de Pollo', 5.5),
 ('Menú de Hamburguesa con queso', 6.6),
 ('Menú de Pollo con queso', 6.6),
 ('Menú de Hamburguesa', 6.6),
 ('Helado', 1.1),
 ('Tarta', 2.2),
 ('Fruta', 1.1),
 ('Agua', 2.2),
 ('Fanta', 3.3)]

In [93]:
df30 = pd.read_sql(query30, connection)
left_align(df30)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\3349450011.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df30 = pd.read_sql(query30, connection)

In [94]:
df30.to_csv('incremento_1.1.csv', index=False)

### 31.Obtener los pedidos cuyo importe es el mayor entre todos los pedidos.

In [95]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query31="""select * from PEDIDO 
where Importe = (select max(Importe) from PEDIDO);"""
cursor.execute(query31)
cursor.fetchall()

[('0010',
  datetime.date(2020, 11, 5),
  45.0,
  '88888888O',
  '14567555L',
  None,
  datetime.timedelta(seconds=79500),
  datetime.timedelta(seconds=79920),
  None),
 ('0011',
  datetime.date(2020, 11, 5),
  45.0,
  '88888888O',
  '14567555L',
  None,
  datetime.timedelta(seconds=79500),
  None,
  None)]

In [96]:
df31 = pd.read_sql(query31, connection)
left_align(df31)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\1154639287.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df31 = pd.read_sql(query31, connection)

In [97]:
df31.to_csv('pedido_mayor_importe.csv', index=False)

### 32. Listar los empleados que no han tomado ningún pedido.

In [98]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query32="""select * from EMPLEADO
left join PEDIDO ON EMPLEADO.DNI=PEDIDO.DNI_ETM
where PEDIDO.DNI_ETM is null;"""
cursor.execute(query32)
cursor.fetchall()

[('14111155T',
  'Sergio Lérida Campos',
  '55577700089',
  'tarde',
  1000.0,
  None,
  None,
  None,
  None,
  None,
  None,
  None,
  None,
  None),
 ('33333333M',
  'Martín Guerrero López',
  '33344455566',
  'tarde',
  1000.0,
  None,
  None,
  None,
  None,
  None,
  None,
  None,
  None,
  None),
 ('55555555J',
  'Carmen Hernández Pío',
  '99966633311',
  'mañana',
  900.0,
  None,
  None,
  None,
  None,
  None,
  None,
  None,
  None,
  None)]

In [99]:
df32 = pd.read_sql(query32, connection)
left_align(df32)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\1781637630.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df32 = pd.read_sql(query32, connection)

In [100]:
df32.to_csv('nombre_empleado.csv', index=False)

### 33. Mostrar el nombre del repartidor y la fecha del pedido para los pedidos entregados en el turno de noche.

In [101]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query33="""select * from 
(select numero,fecha,REPARTIDOR.Nombre,REPARTIDOR.turno from PEDIDO 
left join REPARTIDOR on REPARTIDOR.DNI=PEDIDO.DNI_R) as tabla
where tabla.turno = "noche";"""
cursor.execute(query33)
cursor.fetchall()

[('0004', datetime.date(2020, 11, 10), 'Laura Jiménez Jiménez', 'noche'),
 ('0006', datetime.date(2020, 11, 15), 'Laura Jiménez Jiménez', 'noche'),
 ('0008', datetime.date(2020, 9, 15), 'Juan Pardo Rubio', 'noche')]

In [102]:
df33 = pd.read_sql(query33, connection)
left_align(df33)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\2822222781.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df33 = pd.read_sql(query33, connection)

In [103]:
df33.to_csv('repartidor_pedidos_noche.csv', index=False)

### 34.Obtener el nombre del producto más caro y su precio.

In [104]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query34="""select nombre,precio from PRODUCTO
where precio=(select max(precio) from PRODUCTO);"""
cursor.execute(query34)
cursor.fetchall()

[('Menú de Hamburguesa con queso', 6.0),
 ('Menú de Pollo con queso', 6.0),
 ('Menú de Hamburguesa', 6.0)]

In [105]:
df34 = pd.read_sql(query34, connection)
left_align(df34)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\2281538266.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df34 = pd.read_sql(query34, connection)

In [106]:
df34.to_csv('mayor_precio_producto.csv', index=False)

### 35.Mostrar el nombre del empleado y el importe total de los pedidos que ha tomado.

In [107]:
connection = mysql.connector.connect(host=' ', database=  , user=   , password=   , connection_timeout=180)
cursor=connection.cursor()
query35="""select EMPLEADO.nombre, sum(PEDIDO.importe) as importe_total from EMPLEADO
left join PEDIDO on EMPLEADO.dni=PEDIDO.DNI_ETM
group by EMPLEADO.nombre; ;"""
cursor.execute(query35)
cursor.fetchall()

[('María Luisa Galdón Ter', 17.0),
 ('Úrsula Delta Camacho', 25.0),
 ('Luis Ramírez Pardo', 10.0),
 ('Sergio Lérida Campos', None),
 ('Piedad Colmenero Zapillo', 37.0),
 ('María Sánchez Cid', 15.0),
 ('Martín Guerrero López', None),
 ('Carmen Hernández Pío', None),
 ('Pedro Jiménez Ruiz', 13.0),
 ('Soledad Campillo Molina', 90.0),
 ('Raúl Rodrigo Roca', 27.0)]

In [108]:
df35 = pd.read_sql(query35, connection)
left_align(df35)

C:\Users\Win10\AppData\Local\Temp\ipykernel_3652\2907695868.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df35 = pd.read_sql(query35, connection)

In [109]:
df35.to_csv('importepedidos_empleado.csv', index=False)